package crawler_test

import (
	"testing"

	"github.com/capybara-alt/my-assemble/infrastructure/crawler"
	"github.com/capybara-alt/my-assemble/model"
	"github.com/stretchr/testify/assert"
)

func TestGeneratorInnerPartsCrawler(t *testing.T) {
	test := struct {
		name string
		want model.Want[model.CrawlResultJSON]
	}{
		name: "[正常系]ジェネレーターページのクロールテスト",
		want: model.Want[model.CrawlResultJSON]{
			Value: model.CrawlResultJSON{
				string(model.GENERATOR_INNER_UNIT_TYPE): {
					"ジェネレータ": {
						"AG-J-098 JOSO": {
							"メーカー":     "BAWS",
							"価格":       "-",
							"レギュレーション": "1.03.1",
							"EN容量":     "2300 (+100)",
							"EN補充性能":   "769",
							"供給復元性能":   "500 (+100)",
							"復元時補充EN":  "400",
							"EN射撃武器適性": "72 (+20)",
							"重量":       "3420",
							"EN出力":     "2600",
						},
						"AG-E-013 YABA": {
							"メーカー":     "BAWS",
							"価格":       "240,000",
							"レギュレーション": "1.03.1",
							"EN容量":     "2850 (+300)",
							"EN補充性能":   "1000",
							"供給復元性能":   "555 (+55)",
							"復元時補充EN":  "1000",
							"EN射撃武器適性": "95 (+20)",
							"重量":       "5080",
							"EN出力":     "3000",
						},
						"AG-T-005 HOKUSHI": {
							"メーカー":     "BAWS",
							"価格":       "312,000",
							"レギュレーション": "1.03.1",
							"EN容量":     "3160 (+450)",
							"EN補充性能":   "952",
							"供給復元性能":   "370",
							"復元時補充EN":  "850",
							"EN射撃武器適性": "90 (+20)",
							"重量":       "7080",
							"EN出力":     "3810",
						},
						"DF-GN-02 LING-TAI": {
							"メーカー":     "大豊核心工業集団",
							"価格":       "90,000",
							"EN容量":     "2000",
							"EN補充性能":   "2000",
							"供給復元性能":   "833",
							"復元時補充EN":  "280",
							"EN射撃武器適性": "61",
							"重量":       "3860",
							"EN出力":     "2340",
						},
						"DF-GN-06 MING-TANG": {
							"メーカー":     "大豊核心工業集団",
							"価格":       "170,000",
							"EN容量":     "2900",
							"EN補充性能":   "1250",
							"供給復元性能":   "666",
							"復元時補充EN":  "440",
							"EN射撃武器適性": "76",
							"重量":       "6320",
							"EN出力":     "3160",
						},
						"DF-GN-08 SAN-TAI": {
							"メーカー":     "大豊核心工業集団",
							"価格":       "300,000",
							"EN容量":     "4420",
							"EN補充性能":   "1176",
							"供給復元性能":   "625",
							"復元時補充EN":  "810",
							"EN射撃武器適性": "88",
							"重量":       "10060",
							"EN出力":     "3210",
						},
						"VP-20S": {
							"メーカー":     "アーキバス",
							"価格":       "126,000",
							"EN容量":     "2500",
							"EN補充性能":   "833",
							"供給復元性能":   "434",
							"復元時補充EN":  "1200",
							"EN射撃武器適性": "94",
							"重量":       "3800",
							"EN出力":     "3200",
						},
						"VP-20C": {
							"メーカー":     "アーキバス",
							"価格":       "229,000",
							"EN容量":     "2720",
							"EN補充性能":   "909",
							"供給復元性能":   "454",
							"復元時補充EN":  "1100",
							"EN射撃武器適性": "100",
							"重量":       "5320",
							"EN出力":     "3670",
						},
						"VP-20D": {
							"メーカー":     "アーキバス",
							"価格":       "416,000",
							"EN容量":     "3250",
							"EN補充性能":   "714",
							"供給復元性能":   "384",
							"復元時補充EN":  "1400",
							"EN射撃武器適性": "98",
							"重量":       "11030",
							"EN出力":     "4430",
						},
						"VE-20A": {
							"メーカー":     "アーキバス先進開発局",
							"価格":       "206,000",
							"EN容量":     "2460",
							"EN補充性能":   "740",
							"供給復元性能":   "416",
							"復元時補充EN":  "600",
							"EN射撃武器適性": "116",
							"重量":       "3590",
							"EN出力":     "3120",
						},
						"VE-20B": {
							"メーカー":     "アーキバス先進開発局",
							"価格":       "324,000",
							"EN容量":     "3300",
							"EN補充性能":   "763",
							"供給復元性能":   "392",
							"復元時補充EN":  "800",
							"EN射撃武器適性": "150",
							"重量":       "5860",
							"EN出力":     "2890",
						},
						"VE-20C": {
							"メーカー":     "アーキバス先進開発局",
							"価格":       "405,000",
							"EN容量":     "3690",
							"EN補充性能":   "555",
							"供給復元性能":   "377",
							"復元時補充EN":  "720",
							"EN射撃武器適性": "128",
							"重量":       "10130",
							"EN出力":     "4090",
						},
						"IA-C01G: AORTA": {
							"メーカー":     "ルビコン調査技研",
							"価格":       "460,000",
							"EN容量":     "3000",
							"EN補充性能":   "238",
							"供給復元性能":   "333",
							"復元時補充EN":  "2000",
							"EN射撃武器適性": "105",
							"重量":       "4330",
							"EN出力":     "3500",
						},
						"IB-C03G: NGI 000": {
							"メーカー":     "ルビコン調査技研",
							"価格":       "510,000",
							"EN容量":     "4400",
							"EN補充性能":   "250",
							"供給復元性能":   "312",
							"復元時補充EN":  "3300",
							"EN射撃武器適性": "110",
							"重量":       "8950",
							"EN出力":     "4340",
						},
					},
				},
			},
			ErrMsg: "",
		},
	}
	c := crawler.NewGeneratorInnerUnit()
	t.Run(test.name, func(t *testing.T) {
		results, err := c.Fetch()
		assert.Equal(t, err, nil)
		assert.Equal(t, test.want.Value, results)
	})
}
