package crawler_test

import (
	"testing"

	"github.com/capybara-alt/my-assemble/infrastructure/crawler"
	"github.com/capybara-alt/my-assemble/model"
	"github.com/stretchr/testify/assert"
)

func TestShieldCrawler(t *testing.T) {
	test := struct {
		name string
		want model.Want[model.CrawlResultJSON]
	}{
		name: "[正常系]シールドページのクロールテスト",
		want: model.Want[model.CrawlResultJSON]{
			Value: model.CrawlResultJSON{
				string(model.SHIELD_WEAPON_UNIT_TYPE): {
					"パルスシールド": {
						"VP-61PS": {
							"カテゴリー":  "PULSE SHIELD",
							"メーカー":   "アーキバス",
							"価格":     "123,000",
							"攻撃軽減":   "58",
							"衝撃軽減":   "40",
							"IG攻撃軽減": "78",
							"IG衝撃軽減": "80",
							"IG持続時間": "0.6",
							"展開時発熱":  "190",
							"展開範囲":   "180",
							"冷却性能":   "144",
							"重量":     "2700",
							"EN負荷":   "310",
						},
						"SI-24: SU-Q5": {
							"カテゴリー":  "PULSE SHIELD",
							"メーカー":   "タキガワ・ハーモニクス",
							"価格":     "43,000",
							"攻撃軽減":   "45",
							"衝撃軽減":   "25",
							"IG攻撃軽減": "65",
							"IG衝撃軽減": "75",
							"IG持続時間": "1.0",
							"展開時発熱":  "160",
							"展開範囲":   "180",
							"冷却性能":   "88",
							"重量":     "2010",
							"EN負荷":   "220",
						},
						"SI-27: SU-R8": {
							"カテゴリー":  "PULSE SHIELD",
							"メーカー":   "タキガワ・ハーモニクス",
							"価格":     "100,000",
							"攻撃軽減":   "63",
							"衝撃軽減":   "48",
							"IG攻撃軽減": "67",
							"IG衝撃軽減": "79",
							"IG持続時間": "0.2",
							"展開時発熱":  "140",
							"展開範囲":   "180",
							"冷却性能":   "110",
							"重量":     "3150",
							"EN負荷":   "323",
						},
					},
					"パルスバックラー": {
						"VP-61PB": {
							"カテゴリー":  "PULSE BUCKLER",
							"メーカー":   "アーキバス",
							"価格":     "76,000",
							"攻撃軽減":   "35",
							"衝撃軽減":   "35",
							"IG攻撃軽減": "96",
							"IG衝撃軽減": "95",
							"IG持続時間": "0.3",
							"展開時発熱":  "480",
							"展開範囲":   "180",
							"冷却性能":   "132",
							"重量":     "1920",
							"EN負荷":   "285",
						},
						"SI-29: SU-TT/C": {
							"カテゴリー":  "PULSE BUCKLER",
							"メーカー":   "タキガワ・ハーモニクス",
							"価格":     "62,000",
							"攻撃軽減":   "30",
							"衝撃軽減":   "56",
							"IG攻撃軽減": "82",
							"IG衝撃軽減": "76",
							"IG持続時間": "1.6",
							"展開時発熱":  "670",
							"展開範囲":   "180",
							"冷却性能":   "142",
							"重量":     "3380",
							"EN負荷":   "385",
						},
					},
					"パルススクトゥム": {
						"VE-61PSA": {
							"カテゴリー":      "PULSE SCUTUM",
							"メーカー":       "アーキバス先進開発局",
							"価格":         "197,000",
							"攻撃軽減":       "86",
							"衝撃軽減":       "70",
							"アイドリング攻撃軽減": "21",
							"アイドリング衝撃軽減": "18",
							"アイドリング時間":   "4.0",
							"展開時発熱":      "270",
							"展開範囲":       "180",
							"冷却性能":       "113",
							"重量":         "4100",
							"EN負荷":       "480",
						},
					},
					"コーラルシールド": {
						"IB-C03W4:NGI 028": {
							"カテゴリー":  "CORAL SHIELD",
							"メーカー":   "ルビコン調査技研",
							"価格":     "255,000",
							"攻撃軽減":   "55",
							"衝撃軽減":   "50",
							"IG攻撃軽減": "88",
							"IG衝撃軽減": "77",
							"IG持続時間": "0.8",
							"展開時発熱":  "450",
							"展開範囲":   "360",
							"冷却性能":   "100",
							"重量":     "2170",
							"EN負荷":   "800",
						},
					},
				},
			},
			ErrMsg: "",
		},
	}
	c := crawler.NewShieldWeapon()
	t.Run(test.name, func(t *testing.T) {
		results, err := c.Fetch()
		assert.Equal(t, err, nil)
		assert.Equal(t, test.want.Value, results)
	})
}
