package crawler_test

import (
	"testing"

	"github.com/capybara-alt/my-assemble/crawler"
	"github.com/capybara-alt/my-assemble/model"
	"github.com/stretchr/testify/assert"
)

func TestExtraWeaponCrawler(t *testing.T) {
	test := struct {
		name string
		want model.Want[model.CrawlResultJSON]
	}{
		name: "[正常系]特殊武器ページのクロールテスト",
		want: model.Want[model.CrawlResultJSON]{
			Value: model.CrawlResultJSON{
				string(model.DEFAULT_WEAPON_ARM_UNIT_TYPE): {
					"スタンガン": {
						"VP-66EG": {
							"カテゴリー":  "STUN GUN",
							"メーカー":   "アーキバス",
							"価格":     "129,000",
							"攻撃力":    "104",
							"衝撃力":    "54",
							"衝撃残留":   "32",
							"直撃補正":   "195",
							"射撃反動":   "14",
							"性能保証射程": "100",
							"有効射程":   "159",
							"連射性能":   "6.7",
							"マガジン弾数": "7",
							"総弾数":    "133",
							"リロード時間": "1.8",
							"弾単価":    "150",
							"重量":     "980",
							"EN負荷":   "247",
						},
					},
					"ナパーム弾ランチャー": {
						"MA-T-222 KYORAI": {
							"カテゴリー":  "NAPALM BOMB LAUNCHER",
							"メーカー":   "BAWS",
							"価格":     "91,000",
							"攻撃力":    "366×3",
							"衝撃力":    "149×3",
							"衝撃残留":   "80×3",
							"爆発範囲":   "20",
							"直撃補正":   "170",
							"射撃反動":   "50",
							"チャージ時間": "0.8",
							"総弾数":    "63",
							"リロード時間": "2.3",
							"弾単価":    "200",
							"重量":     "2890",
							"EN負荷":   "60",
						},
					},
					"ジャミング弾ランチャー": {
						"MA-T-223 KYORIKU": {
							"カテゴリー":  "JAMMING BOMB LAUNCHER",
							"メーカー":   "BAWS",
							"価格":     "103,000",
							"攻撃力":    "0",
							"衝撃力":    "45",
							"衝撃残留":   "4",
							"爆発範囲":   "60",
							"直撃補正":   "100",
							"射撃反動":   "40",
							"チャージ時間": "0.8",
							"総弾数":    "40",
							"リロード時間": "5.5",
							"弾単価":    "100",
							"重量":     "2600",
							"EN負荷":   "52",
						},
					},
					"スタン弾ランチャー": {
						"WS-1200 THERAPIST": {
							"カテゴリー":  "STUN BOMB LAUNCHER",
							"メーカー":   "RaD",
							"価格":     "136,000",
							"攻撃力":    "92×3",
							"衝撃力":    "107×3",
							"衝撃残留":   "46×3",
							"爆発範囲":   "20",
							"直撃補正":   "130",
							"射撃反動":   "40",
							"チャージ時間": "0.8",
							"総弾数":    "57",
							"リロード時間": "2.8",
							"弾単価":    "150",
							"重量":     "3180",
							"EN負荷":   "82",
						},
					},
					"火炎放射器": {
						"WB-0000 BAD COOK": {
							"カテゴリー": "FLAMETHROWER",
							"メーカー":  "RaD",
							"価格":    "48,000",
							"攻撃力":   "85",
							"衝撃力":   "3",
							"衝撃残留":  "1",
							"攻撃時発熱": "15",
							"直撃補正":  "115",
							"射撃反動":  "10",
							"有効射程":  "200",
							"連射性能":  "8.4",
							"総弾数":   "1200",
							"冷却性能":  "250",
							"弾単価":   "40",
							"重量":    "6210",
							"EN負荷":  "403",
						},
					},
					"ハンドミサイル": {
						"HML-G2/P19MLT-04": {
							"カテゴリー":   "HAND MISSILE",
							"メーカー":    "ファーロン・ダイナミクス",
							"価格":      "80,000",
							"攻撃力":     "216×4",
							"衝撃力":     "175×4",
							"衝撃残留":    "123×4",
							"直撃補正":    "155",
							"誘導性能":    "180",
							"有効射程":    "2500",
							"誘導ロック時間": "0.4",
							"最大ロック数":  "4",
							"総弾数":     "180",
							"リロード時間":  "3.0",
							"弾単価":     "150",
							"重量":      "3250",
							"EN負荷":    "165",
						},
					},
					"分裂型ハンドミサイル": {
						"HML-G3/P08SPL-06": {
							"カテゴリー":   "SPLIT HAND MISSILE",
							"メーカー":    "ファーロン・ダイナミクス",
							"価格":      "127,000",
							"攻撃力":     "1056",
							"衝撃力":     "600",
							"衝撃残留":    "420",
							"直撃補正":    "145",
							"誘導性能":    "180",
							"有効射程":    "1425",
							"誘導ロック時間": "0.6",
							"最大ロック数":  "1",
							"総弾数":     "36",
							"リロード時間":  "4.0",
							"弾単価":     "650",
							"重量":      "4630",
							"EN負荷":    "180",
						},
					},
					"包囲型ハンドミサイル": {
						"WS-5000 APERITIF": {
							"カテゴリー":    "SIEGE HAND MISSILE",
							"メーカー":     "RaD",
							"価格":       "168,000",
							"レギュレーション": "1.03.1",
							"攻撃力":      "78×13",
							"衝撃力":      "78×13",
							"衝撃残留":     "47×13",
							"直撃補正":     "155",
							"誘導性能":     "180 (-40)",
							"有効射程":     "1200",
							"誘導ロック時間":  "0.5",
							"最大ロック数":   "1",
							"総弾数":      "338",
							"リロード時間":   "6.5 (+1.5)",
							"弾単価":      "70",
							"重量":       "4600",
							"EN負荷":     "165",
						},
					},
				},
			},
			ErrMsg: "",
		},
	}
	c := crawler.NewExtraWeaponCrawler()
	t.Run(test.name, func(t *testing.T) {
		results, err := c.Crawl()
		assert.Equal(t, err, nil)
		assert.Equal(t, test.want.Value, results)
	})
}
