package crawler_test

import (
	"testing"

	"github.com/capybara-alt/my-assemble/crawler"
	"github.com/capybara-alt/my-assemble/model"
	"github.com/stretchr/testify/assert"
)

func TestOtherLegsCrawler(t *testing.T) {
	test := struct {
		name string
		want model.Want[model.CrawlResultJSON]
	}{
		name: "[正常系]2脚以外の脚部ページのクロールテスト",
		want: model.Want[model.CrawlResultJSON]{
			Value: model.CrawlResultJSON{
				string(model.LEGS_UNIT_TYPE): {
					"逆関節": {
						"KASUAR/42Z": {
							"メーカー":     "シュナイダー",
							"価格":       "192,000",
							"レギュレーション": "1.03.1",
							"AP":       "3400",
							"耐弾防御":     "293",
							"耐EN防御":    "328",
							"耐爆防御":     "290",
							"姿勢安定性能":   "630 (+100)",
							"積載上限":     "47820",
							"水平跳躍性能":   "386",
							"垂直跳躍性能":   "80",
							"重量":       "19060",
							"EN負荷":     "388",
						},
						"06-042 MIND BETA": {
							"メーカー":     "オールマインド",
							"価格":       "521,000",
							"レギュレーション": "1.03.1",
							"AP":       "3920",
							"耐弾防御":     "340",
							"耐EN防御":    "360",
							"耐爆防御":     "364",
							"姿勢安定性能":   "675 (+100)",
							"積載上限":     "61600",
							"水平跳躍性能":   "334",
							"垂直跳躍性能":   "60",
							"重量":       "22000",
							"EN負荷":     "426",
						},
						"RC-2000 SPRING CHICKEN": {
							"メーカー":     "RaD",
							"価格":       "419,000",
							"レギュレーション": "1.03.1",
							"AP":       "4080",
							"耐弾防御":     "357",
							"耐EN防御":    "334",
							"耐爆防御":     "360",
							"姿勢安定性能":   "686 (+100)",
							"積載上限":     "68360",
							"水平跳躍性能":   "317",
							"垂直跳躍性能":   "70",
							"重量":       "25890",
							"EN負荷":     "402",
						},
					},
					"四脚": {
						"LG-033M VERRILL": {
							"メーカー":     "ベイラム",
							"価格":       "465,000",
							"レギュレーション": "1.03.1",
							"AP":       "5250 (-1600)",
							"耐弾防御":     "402",
							"耐EN防御":    "357",
							"耐爆防御":     "372",
							"姿勢安定性能":   "1413",
							"積載上限":     "76200",
							"水平跳躍性能":   "82",
							"垂直跳躍性能":   "15",
							"重量":       "36200",
							"EN負荷":     "675",
						},
						"VP-424": {
							"メーカー":     "アーキバス",
							"価格":       "313,000",
							"レギュレーション": "1.03.1",
							"AP":       "4100 (-1500)",
							"耐弾防御":     "366",
							"耐EN防御":    "384",
							"耐爆防御":     "386",
							"姿勢安定性能":   "1366",
							"積載上限":     "69800",
							"水平跳躍性能":   "103",
							"垂直跳躍性能":   "18",
							"重量":       "31600",
							"EN負荷":     "760",
						},
					},
					"タンク": {
						"LG-022T BORNEMISSZA": {
							"メーカー":       "ベイラム",
							"価格":         "280,000",
							"AP":         "10040",
							"耐弾防御":       "440",
							"耐EN防御":      "336",
							"耐爆防御":       "399",
							"姿勢安定性能":     "1630",
							"積載上限":       "100300",
							"走行性能":       "150",
							"高速走行性能":     "376",
							"推力":         "4667",
							"上昇推力":       "3667",
							"上昇消費EN":     "700",
							"QB推力":       "22150",
							"QB噴射時間":     "0.34",
							"QB消費EN":     "810",
							"QBリロード時間":   "0.80",
							"QBリロード保証重量": "100300",
							"AB推力":       "8001",
							"AB消費EN":     "360",
							"重量":         "49800",
							"EN負荷":       "455",
						},
						"VE-42B": {
							"メーカー":       "アーキバス先進開発局",
							"価格":         "490,000",
							"AP":         "8600",
							"耐弾防御":       "379",
							"耐EN防御":      "460",
							"耐爆防御":       "406",
							"姿勢安定性能":     "924",
							"積載上限":       "91000",
							"走行性能":       "136",
							"高速走行性能":     "316",
							"推力":         "5984",
							"上昇推力":       "5001",
							"上昇消費EN":     "912",
							"QB推力":       "21500",
							"QB噴射時間":     "0.40",
							"QB消費EN":     "880",
							"QBリロード時間":   "0.70",
							"QBリロード保証重量": "91000",
							"AB推力":       "10502",
							"AB消費EN":     "430",
							"重量":         "46600",
							"EN負荷":       "824",
						},
						"EL-TL-11 FORTALEZA": {
							"メーカー":       "エルカノ",
							"価格":         "385,000",
							"レギュレーション":   "1.03.1",
							"AP":         "5860",
							"耐弾防御":       "345 (-50)",
							"耐EN防御":      "311 (-60)",
							"耐爆防御":       "314 (-66)",
							"姿勢安定性能":     "822 (-50)",
							"積載上限":       "69300",
							"走行性能":       "194",
							"高速走行性能":     "430",
							"推力":         "5334",
							"上昇推力":       "4667",
							"上昇消費EN":     "780",
							"QB推力":       "25000",
							"QB噴射時間":     "0.26",
							"QB消費EN":     "720",
							"QBリロード時間":   "0.50",
							"QBリロード保証重量": "69300",
							"AB推力":       "8835",
							"AB消費EN":     "378",
							"重量":         "24650",
							"EN負荷":       "620",
						},
					},
				},
			},
			ErrMsg: "",
		},
	}
	c := crawler.NewOtherLegsFrameCrawler()
	t.Run(test.name, func(t *testing.T) {
		results, err := c.Crawl()
		assert.Equal(t, err, nil)
		assert.Equal(t, test.want.Value, results)
	})
}
